org/mysql_restore_db_and_table.org
:PROPERTIES:
:ID:       C2D1D8BB-061E-4B6E-8E8B-5BE711B2E194
:mtime:    20230806140602
:ctime:    20230806140602
:END:
#+title: [mysql] restore db and table
#+AUTHOR: holy
#+EMAIL: hoyoul.park@gmail.com
#+DATE: <2023-08-06 Sun>
#+DESCRIPTION: 옛날 자료 취합
#+HUGO_DRAFT: true
* data backup and restore in mysql
** database 백업 및 복원
 #+begin_attention
 mysql의 백업과 복원은 간단하다. >(redirection)을 쓰면 되기 때문이다.
우선 backup하려는 db를 선택하고 shell에서 다음 명령어를 실행 하면 된다.
 #+begin_example
mysqldump -uroot -p mydb > mydb.sql
 #+end_example
복원에 앞서 db를 만들어놔야 한다. 그런 다음 백업 파일로부터 db를 복원한다.

 #+begin_example
mysql -uroot -p mynewdb < mydb.sql
 #+end_example

database의 백업과 복원은 이렇게 하면 된다.
 #+end_attention
** table의 백업과 복원
 #+begin_attention
 table의 백업과 복원도 어렵지 않다.

우선 백업은 다음과 같다.

 #+begin_example
mysqldump -uroot -p db명 table명 > 백업파일
 #+end_example

복원도 원하는 db를 정해주고 redirection하면 된다.

 #+begin_example
mysql -uroot -p db명 <백업파일
 #+end_example

 #+end_attention
* query를 파일에 저장
** 
